#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure[0].azurerm_linux_virtual_machine.hnt_terraform_vm will be created
  + resource "azurerm_linux_virtual_machine" "hnt_terraform_vm" {
      + admin_username                                         = "az-admin"
      + allow_extension_operations                             = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "hostname"
      + disable_password_authentication                        = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "centralindia"
      + max_bid_price                                          = -1
      + name                                                   = "fleet-server"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "hnt-rg"
      + size                                                   = "Standard_B1ms"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCvVkRh72cGQ/maqthvUSPgwRu1H72k+hc6IROpE0xv/pNBjALug+1rFZcWdDeyQDFSoUvbFJYzN1MwczAvaKojs4mnO1DFGUZpTUj2zt3u16CTygB4y8TgmA8aU7POnyu7rX5shcERzIiJOlZo1JVwPGf2iPsjpCVZek9nWbLFaeUG8d4Gbd+RhS6/+3odEEA50Erh5BhjZuKtMe4ikEhVNLKibqHiIY/neAGl4ZJ9fbHW8IgRBuevvUZCcG2Q3rJndV9NEc9lGKgDEiNDh7pY1KWr5egWfr8aB9rX2XMwe6Nfz6cXRA5u2jpsWC1H78Fhzx679cozrhIk9/JPtGK/ admin
            EOT
          + username   = "az-admin"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = "hntOsDisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.azure[0].azurerm_network_interface.hnt_terraform_nic will be created
  + resource "azurerm_network_interface" "hnt_terraform_nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "centralindia"
      + mac_address                    = (known after apply)
      + name                           = "hnt-rg-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "hnt-rg"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "hnt_nic_configuration"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.azure[0].azurerm_network_interface_security_group_association.example will be created
  + resource "azurerm_network_interface_security_group_association" "example" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # module.azure[0].azurerm_network_security_group.hnt_terraform_nsg will be created
  + resource "azurerm_network_security_group" "hnt_terraform_nsg" {
      + id                  = (known after apply)
      + location            = "centralindia"
      + name                = "hnt-rg-nsg"
      + resource_group_name = "hnt-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTP"
              + priority                                   = 1002
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
    }

  # module.azure[0].azurerm_public_ip.hnt_terraform_public_ip will be created
  + resource "azurerm_public_ip" "hnt_terraform_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "centralindia"
      + name                    = "hnt-rg-public-ip"
      + resource_group_name     = "hnt-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.azure[0].azurerm_resource_group.hnt_rg will be created
  + resource "azurerm_resource_group" "hnt_rg" {
      + id       = (known after apply)
      + location = "centralindia"
      + name     = "hnt-rg"
    }

  # module.azure[0].azurerm_subnet.hnt_terraform_subnet will be created
  + resource "azurerm_subnet" "hnt_terraform_subnet" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "hnt-rg-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "hnt-rg"
      + virtual_network_name                          = "hnt-rg-vnet"
    }

  # module.azure[0].azurerm_virtual_network.hnt_terraform_network will be created
  + resource "azurerm_virtual_network" "hnt_terraform_network" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "centralindia"
      + name                           = "hnt-rg-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "hnt-rg"
      + subnet                         = (known after apply)
    }

  # module.azure[0].random_id.random_id will be created
  + resource "random_id" "random_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "resource_group" = "hnt-rg"
        }
    }

  # module.cloudflare.cloudflare_dns_record.api will be created
  + resource "cloudflare_dns_record" "api" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "api.hack-nocturne.in"
      + proxiable        = (known after apply)
      + proxied          = true
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "69defe33500abb1980b89042369243d0"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @Techzy-Programmer, Action: `pull_request`*